# Parameter Type Id Create Chain Property

Source: https://www.revitapidocs.com/2026/b2034272-4f1e-9292-8811-52511918591e.htm

---

| Parameter Type Id Create Chain Property |
| --- |

"Chain"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId CreateChain { get; }
```

```
Public Shared ReadOnly Property CreateChain As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ CreateChain {
	ForgeTypeId^ get ();
}
```

```
static member CreateChain : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace